# Пользователь вводит номер буквы в алфавите.
# Определить, какая это буква.

a = chr(int(input("введите число от 1 до 26 ")) + 96)

print(f"Ваше число соответствует букве {a} английского алфавита")
